

{
  "image": "/static/images/afbanner.jpg",
  "fullform": "I was taking this Safari with my friend and fifth time Journey To Africa Safari-goer Alisa. I have been planning Safaris for her since 2005 - she has been to Tanzania, Rwanda, South Africa, Namibia. We had been talking about taking a Safari together and when I heard about Congo Conservation Company in Odzala-Kokoua National Park, Republic of the Congo, I was really curious and when I suggested this to her, she was game.Republic of the Congo To my guests who have been on Safari before to Eastern and Southern Africa, the Odzala-Kokoua National Park [Congo Basin] is nothing like what we are used to. Honestly, it took a while for me to adjust to the fact that I will not be seeing the an abundance of wildlife because the terrain is so different. But once I wrapped that around my head, the experience will forever be unique.How was the Odzala-Kokoua National Park different: Lots of walking. We sat in the vehicle for short amounts of time - just to head to the river dock or once for 2 hours to transfer from camp to camp. The rest of the time, we walked. Trekking through the dense forests using the animals path [harden by their walk otherwise the ground was soft], the elephant corridor in Lango Camp which was beautiful with lilies and was waist deep [had me pause for a bit], walked early morning fast under the guidance of master trekker Zephran to see the lowland gorillas from Ngaga Camp [located right outside Odzala-Kokoua National Park in the Ndzehi Forest], walked to get from Mboko Camp to Lango Camp after kayaking. You get the idea - it was definitely an active Safari.",


  "image1": "/static/images/afbanner2.jpg",


  "text2":"This was fun. We got to get on the boat and cruise down Lekoli River. This is when we saw the a few forest elephants on the banks and one crossing the river. They are pretty skittish - as soon as they smell you, they walk away. We also got the enjoy kayaking from camp to camp. You dont have to do this but if you like, you kayak down from Mboko Camp to Lango Camp. We got to see the flock of green pigeons as soon as we parked our kayaks. Some of the best landscape views when boating and kayaking of the Congo Basin.",


  "text3":"Having said that, we met a couple from New York who were there and they had not been on Safari before but loved their time here. They were truly disconnected [not much wi-fi here], enjoyed every encounter thoroughly, enjoyed the small things, great food, hardly took pictures, and brought a film camera - so there, if you are like them, you will love this place."
}

